---
title: CurveByPointsArray
classe: Autodesk.Revit.DB.CurveByPointsArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# CurveByPointsArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `curveByPointsArray.IsEmpty` | Boolean |
| `CurveByPoints Item { get; set; }` | `curveByPointsArray.Item` | CurveByPoints |
| `Int32 Size { get; }` | `curveByPointsArray.Size` | Int32 |
| `Void Append(CurveByPoints)` | `curveByPointsArray.Append(item)` | Void |
| `Void Clear()` | `curveByPointsArray.Clear()` | Void |
| `CurveByPointsArrayIterator ForwardIterator()` | `curveByPointsArray.ForwardIterator()` | CurveByPointsArrayIterator |
| `IEnumerator GetEnumerator()` | `curveByPointsArray.GetEnumerator()` | IEnumerator |
| `Void Insert(CurveByPoints, Int32)` | `curveByPointsArray.Insert(item, index)` | Void |
| `CurveByPointsArrayIterator ReverseIterator()` | `curveByPointsArray.ReverseIterator()` | CurveByPointsArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```